"""
นักศึกษาได้รับมอบหมายให้จัดการรายการสินค้าที่ต้องซื้อสำหรับงานเลี้ยง โดยมีรายการสินค้าทั้งหมด 2 ประเภท เป็นชนิดข้อมูลอะไรก็ได้ คือ
รายการสินค้าที่มีอยู่แล้วในครัว (เซต A)
รายการสินค้าที่ต้องซื้อ (เซต B)
ให้เขียนโปรแกรมเพื่อจัดการและวิเคราะห์รายการสินค้าที่ต้องซื้อ ดังนี้
ให้กรอกชื่อสินค้า แยกเป็นสองกลุ่ม คือ กลุ่มสินค้าที่มีอยู่แล้วในครัว (เซต A) และกลุ่มสินค้าที่ต้องซื้อ (เซต B) ในรูปแบบที่คั่นด้วยเครื่องหมายจุลภาค (,) เช่น ข้าว, น้ำตาล, ไข่ไก่
ให้จัดการข้อผิดพลาด (Error Handling) ดังนี้
ถ้าผู้ใช้ไม่ป้อนข้อมูล ให้แสดงข้อความว่า "กรุณากรอกรายการสินค้าอย่างน้อยหนึ่งรายการ"
ถ้าข้อมูลที่ป้อนมีแต่ช่องว่างหรือเป็นเครื่องหมายจุลภาคล้วน ๆ ให้แสดงข้อความว่า "กรุณากรอกชื่อรายการสินค้าที่ถูกต้อง"
ถ้าเกิดข้อผิดพลาดอื่น ๆ ให้แสดงข้อความว่า "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ"
ให้แสดงผลลัพธ์
รายการสินค้าทั้งหมดที่ต้องมี (Union)
รายการสินค้าที่ซ้ำกัน (Intersection)
รายการสินค้าที่มีอยู่แล้วในครัว ไม่ต้องซื้ออีก (Difference A - B)
รายการสินค้าที่ต้องซื้อแต่ไม่มีในครัว (Difference B - A)
รายการสินค้าที่ไม่ซ้ำกัน (Symmetric Difference)

กรอกรายการสินค้าที่มีอยู่แล้วในครัว: ข้าว, น้ำตาล, ไข่ไก่, น้ำมัน
กรอกรายการสินค้าที่ต้องซื้อ: น้ำตาล, น้ำมัน, ผัก, เนื้อหมู

รายการสินค้าทั้งหมดที่ต้องมี: {'ผัก', 'น้ำมัน', 'ไข่ไก่', 'น้ำตาล', 'เนื้อหมู', 'ข้าว'}
รายการสินค้าที่ซ้ำกัน: {'น้ำมัน', 'น้ำตาล'}
รายการสินค้าที่มีอยู่แล้วในครัว ไม่ต้องซื้ออีก: {'ข้าว', 'ไข่ไก่'}
รายการสินค้าที่ต้องซื้อแต่ไม่มีในครัว: {'ผัก', 'เนื้อหมู'}
รายการสินค้าที่ไม่ซ้ำกัน: {'ผัก', 'ไข่ไก่', 'เนื้อหมู', 'ข้าว'}

-----------------------------------------------

กรอกรายการสินค้าที่มีอยู่แล้วในครัว: (Enter)
ข้อผิดพลาด: กรุณากรอกรายการสินค้าอย่างน้อยหนึ่งรายการ

-----------------------------------------------

กรอกรายการสินค้าที่มีอยู่แล้วในครัว: ,,,,,,,
ข้อผิดพลาด: กรุณากรอกชื่อรายการสินค้าที่ถูกต้อง
"""


def err_msg(msg: str) -> None:
    print(f"ข้อผิดพลาด: {msg}")
    exit()


try:
    A = input("กรอกรายการสินค้าที่มีอยู่แล้วในครัว: ")
    if A == "":
        err_msg("กรุณากรอกรายการสินค้าอย่างน้อยหนึ่งรายการ")
    elif not set(A.split(",")).pop():
        err_msg("กรุณากรอกชื่อรายการสินค้าที่ถูกต้อง")

    B = input("กรอกรายการสินค้าที่ต้องซื้อ: ")
    if B == "":
        err_msg("กรุณากรอกรายการสินค้าอย่างน้อยหนึ่งรายการ")
    elif not set(B.split(",")).pop():
        err_msg("กรุณากรอกชื่อรายการสินค้าที่ถูกต้อง")

    A = set(map(str.strip, A.strip().split(",")))
    B = set(map(str.strip, B.strip().split(",")))
    print(f"รายการสินค้าทั้งหมดที่ต้องมี: {A.union(B)}")
    print(f"รายการสินค้าที่ซ้ำกัน: {A.intersection(B)}")
    print(f"รายการสินค้าที่มีอยู่แล้วในครัว ไม่ต้องซื้ออีก: {A.difference(B)}")
    print(f"รายการสินค้าที่ต้องซื้อแต่ไม่มีในครัว: {B.difference(A)}")
    print(f"รายการสินค้าที่ไม่ซ้ำกัน: {A.symmetric_difference(B)}")

except Exception:
    print("เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ")
