"""
จงเขียนโปรแกรมคำนวณความเข้มข้นของยาในร่างกายตามเวลา โดยใช้ฟังก์ชันเอ็กซ์โพแนนเชียล (Exponential Function) และใช้การเก็บข้อมูลแบบ Dictionary

สูตรที่ใช้ในการคำนวณความเข้มข้นของยาในร่างกายคือ C = C₀ * e^(-kt)
C คือ ความเข้มข้นของยา ณ เวลา t
C₀ คือ ความเข้มข้นเริ่มต้นของยา (ในที่นี้คือ initial_dose)
e คือ ค่าคงตัวทางคณิตศาสตร์ มีค่าประมาณ 2.71828
k คือ อัตราการสลายตัวของยา
t คือ เวลาที่ผ่านไป
สูตรคำนวณค่า k (อัตราการสลายตัว) จากครึ่งชีวิตของยา: k = ln(2) / half_life

ตัวอย่างการใช้งาน
C₀ : initial_dose = 100 # ปริมาณยาเริ่มต้น 100 มิลลิกรัม
half_life = 4 # ยาจะมีชีวิตครึ่งหนึ่ง เมื่อกินยาไป 4 ชั่วโมง
duration = 24 # ระยะเวลาที่ต้องการคำนวณ 24 ชั่วโมง
interval = 2 # แสดงผลทุก 2 ชั่วโมง

ปริมาณยาเริ่มต้น: 100 มิลลิกรัม
ครึ่งชีวิตของยา: 4 ชั่วโมง
ระยะเวลาที่คำนวณ: 24 ชั่วโมง

ความเข้มข้นของยาตามเวลา:
เวลา (ชั่วโมง) | ความเข้มข้น (มิลลิกรัม)
-----------------------------------
             0 |               100.00
             2 |                70.71
             4 |                50.00
             6 |                35.36
             8 |                25.00
            10 |                17.68
            12 |                12.50
            14 |                 8.84
            16 |                 6.25
            18 |                 4.42
            20 |                 3.12
            22 |                 2.21
            24 |                 1.56

เวลาที่ความเข้มข้นลดลงครึ่งหนึ่ง: 4 ชั่วโมง
"""

import math


e = 2.71828
initial_dose = int(input("initial dose : "))
half_life = int(input("half life : "))
duration = int(input("duration : "))
interval = int(input("interval : "))
# t = 2
k = math.log(2) / half_life

print(
    f"""
ปริมาณยาเริ่มต้น: {initial_dose} มิลลิกรัม
ครึ่งชีวิตของยา: {half_life} ชั่วโมง
ระยะเวลาที่คำนวณ: {duration} ชั่วโมง

ความเข้มข้นของยาตามเวลา:
เวลา (ชั่วโมง) | ความเข้มข้น (มิลลิกรัม)
-----------------------------------"""
)
for t in range(0, duration + 1, interval):
    C = initial_dose * e ** (-(k * t))
    print(f"\t{t}\t|\t{C:.2f}")

print()
print(f"เวลาที่ความเข้มข้นลดลงครึ่งหนึ่ง: {half_life} ชั่วโมง")
