"""
บริษัทสตาร์ทอัปแห่งหนึ่งได้เปิดตัวเว็บแอปพลิเคชันใหม่ ซึ่งรองรับผู้ใช้งานจำนวนมากเข้ามาพร้อมกัน ซึ่งในระยะ 5 วินาทีแรกหลังจากระบบเปิดให้บริการ ผู้ดูแลระบบทำการบันทึกค่าการใช้ CPU ของเซิร์ฟเวอร์ทุก ๆ เสี้ยววินาที พบว่าค่าดังกล่าวสามารถประมาณได้ด้วยฟังก์ชัน L(t)

โดย L(t) มีหน่วยเป็น "เปอร์เซ็นต์การใช้ CPU" และ t มีหน่วยเป็น "วินาที" ซึ่งมีขอบเขต 0≤t≤5

จงหาคำตอบต่อไปนี้
แสดงค่าที่ผ่านการอินทิกรัลแล้ว เพื่อหาปริมาณการสะสมของการใช้งาน CPU
แสดงค่าเฉลี่ยของการใช้ CPU ในหน่วยเปอร์เซ็นต์ ในช่วงเวลา 5 วินาทีแรก

ตอบ
Integral I = 25
Average CPU usage = 5%
"""

import sympy as sym
t = sym.symbols('t')
L = 2 * t
average = sym.integrate(L, (t, 0, 5)) / 5
print(f"Integral I = {sym.integrate(L, (t, 0, 5))}")
print(f"Average CPU usage = {round(average)}%")