"""
1.จงเขียนโปรแกรมแสดงค่ารหัสแอสกีของตัวอักษร a-z โดยมีเงื่อนไขดังนี้
ให้แยกการแสดงผลค่ารหัสแอสกีของตัวอักษรแต่ละตัวออกจากกันด้วยแท็บ (\t)
ใน 1 บรรทัด ให้แสดงผลรหัสแอสกีของตัวอักษรได้เพียง 5 ตัวอักษรเท่านั้น คือ 
เมื่อครบ 5 ตัวอักษรแล้วต้องขึ้นบรรทัดใหม่ โดยใช้คำสั่งทำซ้ำ for

a = 97     b = 98     c = 99     d = 100     e = 101
f = 102     g = 103     h = 104     i = 105     j = 106
k = 107     l = 108     m = 109     n = 110     o = 111
p = 112     q = 113     r = 114     s = 115     t = 116
u = 117     v = 118     w = 119     x = 120     y = 121
z = 122
"""

import string

i = 0
for char in string.ascii_lowercase:
    print(f"{char} = {ord(char)}", end="\t")
    i += 1
    if i == 5:
        print()
        i = 0
